tap "adoptopenjdk/openjdk"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Run local Kubernetes cluster in Docker
brew "kind"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Mac App Store command-line interface
brew "mas"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Programmatically correct mistyped console commands
brew "thefuck"
# Extract, view, and test RAR archives
brew "unrar"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk15"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
cask "aware"
# Disk space visualizer
cask "daisydisk"
# Voice and text chat software
cask "discord"
# Terminal built on web technologies
cask "hyper"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Open-source mesh processing system
cask "meshlab"
# Peer to peer Bitorrent client
cask "qbittorrent"
cask "sweet-home3d"
# Messaging app with a focus on speed and security
cask "telegram"
# Calling and messaging application focusing on security
cask "viber"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "Disk Speed Test", id: 425264550
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
