tap "adoptopenjdk/openjdk"
tap "beeftornado/rmtree"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jeffreywildman/virt-manager"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Tool Command Language
brew "tcl-tk"
# Core application library for C
brew "glib"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern replacement for 'ls'
brew "exa"
# ASN.1 structure parser library
brew "libtasn1"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Mac App Store command-line interface
brew "mas"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Fast, highly customisable system info script
brew "neofetch"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
cask "a-slower-speed-of-light"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk15"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
cask "aware"
# Time tracking tool for agencies and freelancers
cask "clockify"
# Disk space visualizer
cask "daisydisk"
# Voice and text chat software
cask "discord"
# Git client focusing on productivity
cask "gitkraken"
# Terminal built on web technologies
cask "hyper"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# File system integration
cask "osxfuse"
# Collaboration platform for API development
cask "postman"
# Peer to peer Bitorrent client
cask "qbittorrent"
cask "sweet-home3d"
# Messaging app with a focus on speed and security
cask "telegram"
# Calling and messaging application focusing on security
cask "viber"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "Disk Speed Test", id: 425264550
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
